In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Encoding Technique in ML model.csv')
df

   Marketing spend  Administration  Transport     Area       Profit
0        114523.61       136897.80  471784.10    Dhaka    192261.83
1        162597.70       151377.59  443898.53      Ctg    191792.06
2        153441.51       101145.55  407934.54  Rangpur    191050.39
3        144372.41       118671.85  383199.62    Dhaka    182901.99
4        142107.34        91391.77  366168.42  Rangpur    166187.94
5        131876.90        99814.71  362861.36    Dhaka    158991.12
6        134615.46       147198.87  127716.82      Ctg  15612251.00

In [4]:
df.isnull().sum()

Marketing spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# there are no any null value,,if have any null value then follow the step

In [5]:
mean =df.Transport.mean() 
mean

366223.3414285714

In [6]:
median = df.Transport.median()
median

383199.62

In [7]:
df.Transport = df.Transport.fillna(median)
df.Transport

0    471784.10
1    443898.53
2    407934.54
3    383199.62
4    366168.42
5    362861.36
6    127716.82
Name: Transport, dtype: float64

In [8]:
df.isnull().sum()

Marketing spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# null value filled and start encoding technique

In [9]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [11]:
#replace
df.Area = df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'],[3,2,1])
df.Area

0    3
1    2
2    1
3    3
4    1
5    3
6    2
Name: Area, dtype: int64

# label encoding

In [13]:
from sklearn.preprocessing import LabelEncoder

In [14]:
#recall
df = pd.read_csv('Encoding Technique in ML model.csv')
df

   Marketing spend  Administration  Transport     Area       Profit
0        114523.61       136897.80  471784.10    Dhaka    192261.83
1        162597.70       151377.59  443898.53      Ctg    191792.06
2        153441.51       101145.55  407934.54  Rangpur    191050.39
3        144372.41       118671.85  383199.62    Dhaka    182901.99
4        142107.34        91391.77  366168.42  Rangpur    166187.94
5        131876.90        99814.71  362861.36    Dhaka    158991.12
6        134615.46       147198.87  127716.82      Ctg  15612251.00

In [15]:
label = LabelEncoder()
label

LabelEncoder()

In [16]:
df.Area = label.fit_transform(df['Area'])
df.Area

0    1
1    0
2    2
3    1
4    2
5    1
6    0
Name: Area, dtype: int32

In [17]:
df

   Marketing spend  Administration  Transport  Area       Profit
0        114523.61       136897.80  471784.10     1    192261.83
1        162597.70       151377.59  443898.53     0    191792.06
2        153441.51       101145.55  407934.54     2    191050.39
3        144372.41       118671.85  383199.62     1    182901.99
4        142107.34        91391.77  366168.42     2    166187.94
5        131876.90        99814.71  362861.36     1    158991.12
6        134615.46       147198.87  127716.82     0  15612251.00

In [19]:
#same task by using loop
for col in df.columns:
    if df[col].dtype==np.number:
        continue
    df[col] = LabelEncoder().fit_transform(df[col])

C:\Users\MD.NAIM HOSSAIN\AppData\Local\Temp\ipykernel_12280\3824339818.py:3: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[col].dtype==np.number:

In [20]:
df

   Marketing spend  Administration  Transport  Area       Profit
0        114523.61       136897.80  471784.10     1    192261.83
1        162597.70       151377.59  443898.53     0    191792.06
2        153441.51       101145.55  407934.54     2    191050.39
3        144372.41       118671.85  383199.62     1    182901.99
4        142107.34        91391.77  366168.42     2    166187.94
5        131876.90        99814.71  362861.36     1    158991.12
6        134615.46       147198.87  127716.82     0  15612251.00